chore: change diagram from mermaid to d2
